Catalogs/Абонементы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>Абонементы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПродажи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументПродажи</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Реализация</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаАктивации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДействия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДнейЗаморозки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОстатокДнейЗаморозки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Заморозки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДнейЗаморозки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Абонементы/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПересчетДатаОкончания()
	Объект.ДатаОкончания =  ДобавитьМесяц(Объект.ДатаАктивации, Объект.СрокДействия) + (Объект.Заморозки.Итог("ДнейЗаморозки") * 86400);	
КонецПроцедуры

&НаКлиенте
Процедура ПересчетДОстатокДнейЗаморозки()
	Объект.ОстатокДнейЗаморозки = Объект.ДнейЗаморозки  - Объект.Заморозки.Итог("ДнейЗаморозки");
КонецПроцедуры

&НаКлиенте
Процедура ПересчетДатТЧ()
	
	СтрокаТЧ = Элементы.Заморозки.ТекущиеДанные;
	РасчетДней = (СтрокаТЧ.ДатаОкончания - СтрокаТЧ.ДатаНачала) / 86400;
	СтрокаТЧ.ДнейЗаморозки = 0;
	ПересчетДОстатокДнейЗаморозки();
	
	Если РасчетДней > Объект.ОстатокДнейЗаморозки Тогда
		СтрокаТЧ.ДатаОкончания = СтрокаТЧ.ДатаНачала + (Объект.ОстатокДнейЗаморозки * 86400);
		СтрокаТЧ.ДнейЗаморозки = (СтрокаТЧ.ДатаОкончания - СтрокаТЧ.ДатаНачала) / 86400;
	Иначе
		СтрокаТЧ.ДнейЗаморозки = РасчетДней;
	КонецЕсли;	
		
	КонецПроцедуры
	
	
	&НаКлиенте
	Процедура ДатаАктивацииПриИзменении(Элемент)
		ПересчетДатаОкончания(); 
	КонецПроцедуры
	
	&НаКлиенте
	Процедура СрокДействияПриИзменении(Элемент)
		ПересчетДатаОкончания();
		АвтоНаименование();
	КонецПроцедуры
	
	
	&НаКлиенте
	Процедура ДнейЗаморозкиПриИзменении(Элемент)
		ПересчетДОстатокДнейЗаморозки(); 
	КонецПроцедуры
	
	&НаКлиенте
	Процедура ЗаморозкиДатаНачалаПриИзменении(Элемент)	
		ПересчетДатТЧ();
		ПересчетДатаОкончания();
		ПересчетДОстатокДнейЗаморозки();
	КонецПроцедуры
	
	
	&НаКлиенте
	Процедура ЗаморозкиДатаОкончанияПриИзменении(Элемент)
		ПересчетДатТЧ();
		ПересчетДатаОкончания();
		ПересчетДОстатокДнейЗаморозки();
	КонецПроцедуры
	
	&НаКлиенте
	Процедура АвтоНаименование()
		СклонениеМесяца = "";
		Если Объект.СрокДействия = 1 Тогда
			СклонениеМесяца = "месяц";
		ИначеЕсли Объект.СрокДействия = 2 ИЛИ Объект.СрокДействия = 3 ИЛИ Объект.СрокДействия = 4 Тогда
			СклонениеМесяца = "месяца"; 
		Иначе
			СклонениеМесяца = "месяцев";
		КонецЕсли;
		
		Объект.Наименование = СтрШаблон(" %1 ( %2 на %3 %4)", Объект.Владелец, Объект.Номенклатура, Объект.СрокДействия, СклонениеМесяца); 	
	КонецПроцедуры
	
	&НаКлиенте
	Процедура ВладелецПриИзменении(Элемент)
		АвтоНаименование();
	КонецПроцедуры
	
	&НаКлиенте
	Процедура НоменклатураПриИзменении(Элемент)
		АвтоНаименование();
	КонецПроцедуры
	
	&НаКлиенте
	Процедура ЗаморозкиДнейЗаморозкиПриИзменении(Элемент)
		ПересчетДатаОкончания();
		ПересчетДОстатокДнейЗаморозки();
	КонецПроцедуры
